{
  "posts" : [
    {
      "id": 12,
      "title": "Shanghai (上海)",
      "date": "January 13, 2016",
      "images": true,
      "text": "",
      "formatted_text": ["I’ve been on the road for 24 days, more than three weeks of constant traveling, navigating, and adapting. I’m on vacation, but it doesn’t feel like it anymore. For the past few days, it’s been difficult for me to appreciate new places and I’ve stopped taking pictures altogether. I loathe my lack of focus and energy; my mind has already returned to California, while my body remains reluctantly in China.",
        "I couldn’t be more ready to go home - thankfully, my flight departs in an hour. Most times I travel, I only have hazy half-memories of the locations and the people I encounter. But having blogged through the duration of my trip, my experiences seem so much more meaningful to me. The idea of blogging past this trip is enticing, though I’ve learned how time-consuming the habit can be. I’m not certain about this blog specifically, though. I did intend touse it solely to document this trip (hence the name), and I do have a few more thoughts and a bunch of pictures still that might find their way here over the next few days. As for the goals I initially established at the beginning of this blog, I think I did a fairly good job.",
        "I do have some new goals that are inspired by my travels, though. Over the next year, I will work to:",
        "-Become conversationally fluent in Mandarin Chinese. I plan to watch some Chinese shows and pick up more of the language. I’ll also try to befriend more international Chinese kids and practice speaking with them.",
        "-Gain basic proficiency in the Chinese erhu (二胡), also known as the Chinese violin. We bought this beautiful 2-stringed instrument in Beijing, and while I won’t have it with me in Boston, I’ll be able to practice over the summer",
        "-Become better at pool (billiards), so that I can become a god at dankball. If you’re wondering what dankball is, it’s a dank way to play pool my brother and I invented because we sucked at regular pool. Learn more about the sport here: http://yn-.tumblr.com/post/136108329852/fun-and-games-on-quiet-days",
        "Hope you’ve enjoyed the bits of my journey I shared! Ideally, learned a thing or two about Taiwan and China as well. Until next time...",
        "-Law",
        "Photos taken: 262"]
    },
    {
      "id": 11,
      "title": "Bing Ma Yong (兵马俑) - Terracotta Warriors, Xi’an",
      "date": "January 11, 2016",
      "images": true,
      "text": "",
      "formatted_text": ["Xi'an is home to the famous \"8th wonder of the world,\" the Terracotta Warriors. Contrary to popular belief, they don’t actually directly guard the first emperor’s tomb, but are frozen in rank and file in a few enormous pits several miles away. This is an extremely popular tourist destination, but winter is China’s off-season; the places we’ve visited have frequently been deserted, whether because of the cold or the advanced air pollution. En route to the entrance, we snake through rope lines that would’ve organized hundreds of tourists in the summer. That leaves us vulnerable to legions of tour guides that haunt the area in hopes of a quick buck - some legit, some clever opportunists - but all very persistent. We’re outnumbered at least six to one, and as I continue towards the entrance I say \"bu yong, xie xie\" ( no need, thanks), which by the 5th rejection degenerates into the less considerate \"bu yong.\"",
      "There’s a certain pride I take in learning about a historical place on my own, rather than passively following an ever-present tour guide. I’m gonna call this tourist’s ego. It’s similar to the allure of the road-less-travelled, the anti-mainstream sentiment everyone seems to have nowadays. After all, nothing makes a better story than \"We went off on our own and got lost among the locals,\" getting an experience unique among other travelers. But most of all, I hate not having my own plan and instead depending on someone else to take me around.",
      "Anyways, I’m already conditioned to ignore/reject solicitors from weeks of fending them off on China’s streets. So after clambering past the sea of tour guides, I get to the first pit. It’s an epic scene: a vast, open-air structure housing the underground army, in various states of vitality. Most of the soldiers are smiling at attention, but others are downed, broken at the torso or head with legs still rooted. It’s very surreal. As I’m walking around, I closely observe my the scene below me. I conclude one warrior’s bizarre hand position is a result of the fact that he once held a bow; another’s increased stature I deduce to his higher military rank. But other sights are less obvious. Why aren’t the soldiers so far from the emperor’s tomb? Why aren’t the statues better preserved? Why are some statues tagged with blue instead of red?",
      "I realize I have an infinite amount of questions that I have nobody to ask. I’m the type of person who goes on bottomless Wikipedia binges, taking in as I can remember, so why do I feel content just guessing at the history of such a storied place? Sure, it’s funny reasoning with my brother as to why some terracotta soldiers do or don’t have heads, but it’s more fulfilling to know the truth. Feeling a wave of regret for not having exchanged a measly 100 yuan for a tour guide, I discreetly hover around other groups that have, stitching together pieces of insight to make my own conclusions. But tourist’s ego seems to have gotten the better of me this time.",
      "Still though, there’s so much fun to be had exploring a new place on your own. Like playing a new game without looking through any guides, or listening to your favorite band’s new album without reading the reviews, you know for certain that your experience and your emotions are unbiased and authentic. Besides, Wikipedia will always be there for fact-checking afterwards.",
      "Chinese Museums Visited: 7"]
    },
    {
      "id": 10,
      "title": "Xi'an (西安)",
      "date": "January 8, 2016",
      "images": true,
      "text": "",
      "formatted_text": ["Today we arrived in Xi'an, home of the Qin (秦) Dynasty, the first ancient dynasty in China. We came by rail - not a modern, streamlined steel and glass bullet train but the old-fashioned, \"slow and steady wins the race\" kind of locomotive. It was a 12 hour ride overnight, from 8pm to 8am, but wasn’t actually as uncomfortable as you might be thinking. It’s not like we were sitting immobile amongst the other 500 passengers on the train. In fact, each person had a bed and each group of 4 had a cabin to itself. But don’t get me wrong, it was still pretty uncomfortable. I thought at first our family of four had been mistakenly assigned to a bathroom rather than a cabin, because the door matched in size and decor that of an airplane’s lavatory exactly. But it turns out all the cabins were like that, and the space left by the bunk beds was barely enough to turn around in. After much engineering, we managed to fit our 13 some pieces of luggage with no casualties, and once we settled in, the slightly-too-intimate space lent itself to good conversation and family time. It was indisputably good times.",
      "Or it was at least for me, but my mom was bitterly resentful about literally everything. Of the smoke - anytime she’d catch the slightest whiff she’d immediately announce how her body couldn’t stand it (\"din bu zhu\"), every single time. She snapped at my brother for the subtlest of movements in the bunk above her, calling him inconsiderate and selfish. My mom, a champion dissenter, even pre-anticipated complaints about how she wouldn’t be able to sleep well, \"if at all,\" with the ungraceful movements of the train. Of course, there was plenty of general bickering about China’s pollution problems, the flaws of my dad, and how I didn’t take good pictures of her. Meanwhile, the rest of us attempt to brush her negativity aside and sway her into a better mood, but to no avail.",
      "This relates to one of the golden pillars* of traveling - accommodation. That is, being flexible in your transportation methods, standard of living, mood, and relationships in foreign environments. Good traveling requires the flexibility of accommodation, the ability to sacrifice your normal needs for the sake of a reasonable journey. The train itself: sure, it was cramped and very public. But it was the most cost-efficient method of travel, and a fun adventure at that. It ain’t like home: you’re sleeping on bunked cots in what essentially is a glorified closet, instead of your familiar queen-sized memory foam mattress. But if that isn’t available to you, you need to get over it and make the most of what you have. Most of all is mood: being bitterly negative during a family vacation quickly drains everyone’s pleasantness. So you need to bring a filter or be more strategic with your complaining.",
      "The point of the post is not to shit on my mom; we all have acted childish at inconvenient times and have sabotaged the mood of a trip. I have difficulty changing my normal sleeping patterns for early morning trips. My brother gets hungry easily and often drags the family into dining at random times. These are all things that are can be accounted for: I can sleep earlier, my brother can bring snacks with him. But while you could also argue that our actions are selfish, you could also say that the rest of the family is being neglectful of our needs if they refuse to accommodate us. So I believe that good accommodation is a blend of sacrifice and altruism. You need to be willing to inconvenience yourself for others, regardless of your mood, and not let it strongly sway you emotionally. This is something I’ve been working on, and I think I’m doing a better job of it every day.",
      "*not actually a thing",
      "Current Air Quality Index: 297 (\"very unhealthy\")"]
    },
    {
      "id": 9,
      "title": "Food in Beijing, part II",
      "date": "January 6, 2016",
      "images": true,
      "text": "",
      "formatted_text": ["I noted some of the interesting cultural/practical differences compared to dining in the US. Typically when ordering meals, the menu is controlled by one person, who could be the head of the household/party, guest of honor, or the one paying. Rarely were we offered more than one menu, as dishes are meant to be shared family-style, while in America, each person generally gets his own menu to order an individual dish. I enjoyed the freedom from responsibility, but simultaneously felt powerless at the mercy of another’s tastes. When you’re in a foreign country, this is actually somewhat anxiety-inducing: what if they only order weird stuff and you’re forced to eat it?",
      "No tap water - in fact, our hotel bathroom has an unmissable sign on the sink saying \"Don’t drink tap water.\" Water isn’t quite sanitary enough, so boiled water (kaishui 开水), tea (cha 茶), or soymilk (doujiang 豆浆) is drunk instead, all of which come hot from the boiler. Flavored drinks are really expensive, more so than in the US, unlike the food itself (which I’d say is 2/3 the price of its American counterparts). Hot drinks lend a very different feel to a meal, I would say slower-paced, and slightly blunting the flavor. After all you can’t just take a big gulp of boiling water to wash down some rice, you need to blow on it first. It’s also wouldn’t have the same sharpness going down as ice water does.",
      "Chopsticks are the universal utensil, and people are expected to take food from the communal plates using the same chopsticks they eat with. It requires some dexterity with chopsticks handling; while you want to share food, you don’t want to share your saliva, so you want to quickly and accurately grab the thing you want to eat. I’m not very good with chopsticks, so I get a little anxious whenever it comes to eating stuff like soft tofu. If you’re also bad at using chopsticks, you’d understand, because essentially you’re using two wooden halves of a scissor trying to pick something up without slicing it to bits.",
      "One last note: Western fast food restaurants like Mc Donalds and KFC are popular in Asia, and are also more like classy cafes than quick meal stops. They also have a very different menu, most obviously not beef-centered, with items that tend to be more expensive than standard restaurant fare, despite arguably lower quality ingredients/labor cost.",
      "Unsolicited texts from #’s \"promising a good time\": 十七"]
    },
    {
      "id": 8,
      "title": "Food in Beijing",
      "date": "January 6, 2016",
      "images": true,
      "text": "",
      "formatted_text": ["I wouldn’t say Beijing is renowned for it’s food, but I’ve certainly had my share of tasty meals here. Some Beijing specialties:",
        "shou la mian (手拉面) - \"hand-pulled noodles,\" this describes how the noodles are made rather than the type of dish itself. Commonly in noodle soups/dishes. Very cheap yet very filling, usually around 12-15 yuan for a large bowl that can feed two people. Fun fact - you can also drink the water the noodles are boiled in, it tastes pretty good and is apparently pretty nutritious.",
        "shougong jiaozi (手工饺子) - Handmade dumplings, very fresh and tasty. Some stores have a bunch of different stuffings laid out on dishes next to the dumpling \"flour tortillas,\" with steaming pots behind them. No picture, but there’s something oddly satisfying about this display. You can order any combination you want, ranging from 12-20 yuan for 15 dumplings.",
        "beijing kaoya (北京烤鸭) - Beijing/Peking Roast Duck (Peking being Cantonese for Beijing). Probably the most authentic Beijing dish. Usually eaten in a flour roll with three components: plum sauce, chives, slices of duck meat.",
        "The plum sauce, gives a tangy, sweet-sour flavor, seasoning the fairly bland duck meat, and helps hold the roll together. The chives add bite, in this case there’s also cucumber which counterbalances the sauce and adds crunch.",
        "Of course, there’s the duck. Usually, cut freshly in front of you on a tray by a master butcher, though it can be done in the back of the kitchen and not by a master butcher.",
        "Wrap this up and you’ve got a rich, ducky-tasting roll!"]
    },
    {
      "id": 7,
      "title": "Panjiayuan Market (潘家园), Beijing",
      "date": "January 2, 2016",
      "images": true,
      "text": "",
      "formatted_text": ["I spent the afternoon in Panjiayuan marketplace, a flea market specializing in traditional arts and crafts. Throughout the stalls and stands are rows of colorful stones, beads, statuettes, and other miscellaneous trinkets. Before we enter, my dad warns us that a lot of stuff is fake/and or uses lead paint. \"If you see something nice, buy it to display, not to wear.\" Very China.",
        "Turns out there are tons of people here - Chinese citizens get New Year’s Day off. As I observe the wares, plenty of things catch my eye. Though historically I haven’t been a sucker for bling, I’m fancying the idea of a trinket to hang from my neck. Fake jade is too expensive, so I’m just looking for a nice rock or something. My brother and I weave through the shops, under the watchful eyes of hyper-alert merchants, meticulously examining the items and mentally recording their prices.",
        "After going through several shops, I realize I’m coming down with what I’ll call buyer’s ego. The way I see it, it comes in two parts: the first is that, I become overly suspicious of shopowners and paranoid about prices. I am naturally curious about the true value of an item, and I don’t want to get ripped off. But more important to me is that I don’t get tricked into a bad deal (gypped, so to speak) - that I don’t get played like a tourist in my home country. Sure, it sucks to buy something only to realize a few stalls over I could have saved 10 yuan on it. Yet when it comes to something you’re going to wear for days on end, ten yuan is a drop in the ocean (6 yuan = 1 US dollar). So the sting to my pride would really be that I \"got got,\" that I was foolish enough to overspend.",
        "The second is that I’m getting way too excited about finding a good deal. I know some people who get a rise out of strongarming discounts from flea market shopowners. But why do I feel so compelled to scour every store to find the best price for a rock I don’t even know the name of? I’m not a local and don’t have unlimited time, my Chinese is barely passable - I can hardly carry on a conversation in the language, let alone bargain for wares. But there’s something to be said about the fact that I’ll haggle with a shrewd merchant for a 5 yuan discount, yet with no qualms drop the same amount for a bottle of water ten minutes later. When I have hundreds of Chinese yuan I’ll never spend anyways and have no use for in the states.",
        "Shopping with my parents conditioned me to look at the price tag first, instead of the material, design, or brand. Not to shop for clothes that fit my wardrobe, but clothes that fit my budget. My mom personally would rather buy two cheap things than the one she truly wanted. But near the end of the trip, I find \"the one\": a pale-yellow, rectangular piece of 雨花石 (yuhua shi - \"rain flower stone\"), with a natural groove and a subtle, teardrop-shaped flare stretching down the middle. I’m determined to get it, knowing that the price for can’t be that high; it’s 30 yuan for each piece, but my brother can’t keep himself from suggesting to the shopowner that we’d buy two for 25 yuan each. So that’s the sale, and now I have two dank pieces of 雨花石. What can I say, I love a good deal.",
        "Super Smash Bros. Melee highlight reels watched: 10"]
    },
    {
      "id": 6,
      "title": "Nongguangli Residence (农光里), Beijing",
      "date": "January 1, 2016",
      "images": true,
      "text": "",
      "formatted_text": ["So my brother and I are shooting the shit in our hotel room, when the topic of hotel room theft comes up. It’d be so easy for maintenance workers to steal our laptops and all our luggage, without any fear of confrontation. We decide to establish some barriers of entry, like putting our laptops in their bags, underneath our clothing, and inside our luggage, which would be inside our closet. Obviously, this shoddy 4-level security system wouldn’t stop anyone who was truly gunning for our MacBooks, but it would at least slow him down. I then think about how difficult it would be for someone to rob my grandpa’s apartment. The conclusion I came to: extremely hard.",
      "There are two doors leading to my grandpa’s place. On the outside, there’s a heavy metal gate, the very rattly, inexpensive kind, with an ancient locking mechanism on the handle and a little green button that is neither decorative nor useful. Assuming you didn’t have the key, it wouldn’t impossible for you to smash through the door, but it would make a hell of a lot of noise. But let’s say you did have the key - easy money, right? Nah.",
      "This lock is the most finicky, unpredictable, and unwieldy lock I’ve ever encountered. It simply isn’t a matter of turning the key clockwise until the lock clicks. It’s about carefully positioning the key so it won’t stick, finely sensing the lock’s resistance as you turn, perhaps also taking in account the lock’s emotional state, all to get the alignment just perfect. At any moment, it may jam your key, taking 20 minutes to un-fuckup (happened to my brother, but that’s another entire blog post). Oh yeah, you also need to do all this while pushing the metal door in with your knees, because you’re holding a flashlight in your other hand (since the light in the otherwise pitch-black hallway can only be activated by a loud sound). We’re talking about a rude and truly tsundere piece of metal. There are literally girls out there whose hearts are easier to unlock. ",
      "But say you manage to get past this cold bitch of a door, and claim your reward: maybe my grandpa’s old TV or a book or two on the history of communist China. You’d need only to walk out the front door with your loot - child’s play, right? Nah. More like child’s trap. Remember how I said there were two doors? On your way out, you need to prevail over a second guardian, the final boss so to speak. Let me tell you a story about how I was almost imprisoned within my grandpa’s apartment by this wooden gatekeeper.",
      "At first glance, it’s not very formidable - like most of my grandpa’s property, a little bit too much of a push and it’s gone. But it’s not about pushing, it’s about pulling. This door can only be pulled open, which doesn’t sound so bad until you realize that it doesn’t have a fucking door handle. So if it’s been pushed even slightly too far in, it’ll be near immovable.",
      "Sadly, that was just my situation. Faced with eternal imprisonment in my grandpa’s apartment, I gingerly maneuver my fingers and grip the door in what little space there is between it and the doorframe. I can just barely fit them but can’t grasp it tightly without jamming my fingers. So after pulling and slipping several times, I look up to see a coat hanger attached to the door that, in an ideal world, could be used as a ratchet handle. In my excitement, I forget that the world I inhabit is not ideal, and that the hanger too falls under the archetype of \"Grandpa’s fragile property.\" Of course it comes apart when I give it a tug, and it cracks at my feet.",
      "At this point, I’m willing to do anything to escape the apartment, and my ego can’t be more damaged. So I carefully replace the hanger and call my dad to help me exit the building. After sizing up the situation for a cool minute, he springs into action, reaching for the same coat hanger I broke earlier. As I see his intent, I try to warn him in time, but it’s too late and this time the hanger shatters irreparably on the floor. Plan B: Use more force pulling from the top of the door. I’m impressed because my dad manages to fit his entire hand in the crevice below the doorframe. Yet as he pulls, a loud crack fills the room and the very top of the door pulls inwards - on its own, while the rest of the door stays stubbornly in place. \"Fuck\"",
      "With much effort, I eventually loosen it enough to pry past it. But yeah, there’s still that other door...",
      "Bottles of water consumed: 7"]
    },
    {
      "id": 5,
      "title": "Beijing (北京)",
      "date": "December 30, 2015",
      "images": true,
      "text": "",
      "formatted_text": ["It’s bluish-black in the Beijing dawn and I’m walking, fast. My goal: the Wing King (京瑞) Hotel, where I’m determined to shower, change, and get some breakfast. I’ve just left my grandpa’s place after spending the night there, where the walls are grimy and the rooms are dank - not the good kind but the bad kind, the literal \"uncomfortably damp and chilly\" dank. Though I’m now headed to our hotel room, my grandpa insisted we stay overnight at his place. So I complied, though I didn’t come with much else beyond the clothes on my body.",
      "My grandpa lives very humbly in his apartment (农光里), located in central-ish Beijing. What’s left of his appliances are antiquated or run-down, and he has just his TV, some instruments, and a few shelves of communist books to his name. Whether it’s his eyesight or his attitude, he does an awful job with cooking and cleaning. I’m a little more sensitive, so I see the grit that clings to the dishes, as well as the cockroaches that scurry around the kitchen nearby. I’m not on some charity mission to an impoverished country, so I feel entitled to freely express my disgust at the living conditions.",
      "But this should all be rather trivial in the big picture. After all, I’m here to see my grandpa, who I’ve only visited three times in my life, and what’s a bit of discomfort when it comes to family? The only thing is, and this detail throws my brain into a huge conundrum, is that my grandpa is a man I barely know, and will probably never understand. He’s 88 this year, slightly senile and very stubborn. Outside of my visits, conversations over phone have been few and far in between, and mainly consist of him asking me how old I am, and me superficially wishing him good health.",
      "A man extremely selfish with his emotions, my grandpa confuses me greatly. He offered me was a genuine smile when we first arrived. Yet he declines to eat with us, instead insisting on watching the television with his meal. He seems to prefer the TV over conversation, and is also reluctant to close it at dinnertime or sleeping hours. In fact when I think of my grandpa, I see him head curled over shoulders, watching his favorite channel, the World News, broadcast and broadcast and rebroadcast under the dim light of the living room.",
      "I am more familiar with his contempt, which he gives more liberally when I struggle to do things the way he’s accustomed to. After our dinner, I swallow my disgust and try my hand at the dishes; thank god there’s a sponge and soap. But the soap is just a scaly orange bar and the \"sponge\" is a brush whose fibers have stiffened into coarse wires. The rake-like object won’t catch the soap, so I just scrape it on the plates and slash at them with the brush. Grandpa won’t have it: why am I using so much water? Why wasn’t it obvious that I soak the clean dishes in the sink I have just dirtied? As the cold, wintery water sloughs off the dishes and spills over my hands, I have my own questions: How can I resent the man for living the way he’s comfortable with, even if it upsets me? Why should I be concerned more with my own feelings than his? Yet why should I care at all? For him, the only emotion I can find is pity, which I’m not entitled to and which he has no need for. I don’t feel any obligation, nor do I expect any promise of love or support in return.",
      "But that night, my grandpa set aside the room he normally sleeps in so that we would stay, insisting on the couch instead. He also prepared seven dishes welcoming our arrival to Beijing. Despite my reservations, it simply wouldn’t be right to decline his generosity. And even if he won’t show me any affection, I can’t resent the man for offering me his home, his bed, and his food. So I gingerly lift home-cooked tangcuji from his grungy plates, and embrace what he has to give me. But tonight, I stay at the hotel.",
      "Cockroaches slain: 2",
      "Regrets: 0"]
    },
    {
      "id": 4,
      "title": "Gongguan (公馆), Taipei",
      "date": "December 27, 2015",
      "images": false,
      "text": "",
      "formatted_text": ["Today’s adventures were in Gongguan（公馆), a shopping/night market area in Taipei, where we met up with two friends of mine. I know I went off about how relatives were great, but friends are infinitely better. I’m not sure if it’s a Chinese culture thing, but my brother and I never feel pressured to converse with our older relatives, where in western culture that same reticence would be considered rude. On their side, they also usually assume we don’t speak Chinese (well enough), so they kind of ignore us. Humility and respectfulness towards them is all that they want from us. So when dealing with them, I kind of feel like a shadow, a youthful reflection of my parents rather than my own person.",
        "We first met with Eileen, an ABC like me and a classmate since elementary school, who moved to Taipei during high school. I actually hadn’t seen her in many years, and didn’t expect to see her ever again, but she was thoughtful enough to reach out to me when she heard I was in the area. Truth be told, I was initially a little anxious about our meeting because we hadn’t been on the best of terms the last time we talked. Specifically, Eileen was best friends with a kid I was dating, and to use euphemism, had been highly opinionated about the status of the relationship. So it was great to talk with her, normal human to normal human, after years of misunderstanding and resentment. It’s a shame that it’s so hard to set aside the past and pride, because people would be so much happier. But I digress.",
        "We tried the world’s best qingwa zhuangnai (青蛙撞奶), also the OG qingwa zhuangnai. This literally means \"frog meets milk\", a tongue-in-cheek description of the look of black tapioca pearls (which resemble frog eggs) in flavored milk. Like much of taiwanese cuisine, it was extremely sweet. In fact things are so sweet that many foods/drinks have options like 80%, 50%, no sugar, etc. But despite that, I swear I could feel the onset of diabetes after every sip. The best part of the drink though, was that every cup had a joke on it. My brother and I shared a cup so we got one complimentary joke, a pun, which you’ll need to understand mandarin chinese to get. But I assure you that it was extremely funny. Q: 什么人的肚皮最硬?",
        "A few hours later, we met up with my friend Claire. Claire is a Taipei native and an international student at BU, who I met \"at a party\" this past semester. She came with her friend Josephine, who also studies internationally, in London. Though they didn’t frequent the Gongguan area, they knew what was up in terms of food. Among the many highlights include: douhua (豆花, soft tofu, with toppings like mung beans, tapioca pearls, and jelly), paigu fan (排骨饭, lightly fried pork chops over rice - extremely tasty), and gebao (割包 - like a hot pocket, if the pocket were a wrapped steamed bun filled with pickled vegetables and stewed meat). Unfortunately, I forgot that I had a blog and took no pictures during this time, so the descriptions will have to suffice.",
        "This also served as a great opportunity for me to practice conversational Chinese with people outside my family, which I took full advantage of. I joke that I have an American accent and a \"Integrated Chinese 3\" dialect (The latter being the name of the main book I studied Chinese with in high school). But in just a few hours, I significantly expanded my vocabulary, as well as gained insight in the word preferences that Taiwanese speakers of Chinese have.",
        "Definitely the most fun I’ve had in Taiwan so far. May the times continue to be most excellent.",
        "A: 印度人",
        "Gifted mangoes received: 1"]
    },
    {
      "id": 3,
      "title": "Taizhong (台中)",
      "date": "December 25, 2015",
      "images": false,
      "text": "",
      "formatted_text": ["One thing I love about my relatives in Taiwan is that they never ask me \"How are you doing?\"",
        "I hate the phrase, because of the intrinsic dishonesty of the question. The vast majority of the time, the asker doesn’t actually care about how you’re feeling, and likewise the answerer won’t give an honest answer. I know when I’m not having a good time, which is a lot of the time, I’m not gonna answer with \"doing shitty, you\" and I feel way too fake responding with \"good, thanks.\" But even when I choose the middle ground, \"fine\" or \"alright,\" I always feel that I come across as unsociable.",
        "What’s worse is that it’s impolite not to ask the question back, which especially aggrieves me when dealing with mere acquaintances, because I truly could not care less about their answer to that question. So we just nod and smile and swallow the truth for the sake of politeness. It begs the question, of all the formalities that could be, why on earth did this one have to become the most popular?",
        "Fortunately, my relatives in Taiwan don’t greet me that way. Most of them I’ve only seen once or twice in my life if ever at all. They usually say something like: \"ni zhang zhe me da le!\" (You’ve grown so big!) or \"na me gao le\" (You’re so tall!) This is a pretty standard greeting that I’m sure all Chinese kids have become accustomed to over the years. What’s really interesting is what I call the side-greeting, in which older relatives will loudly compliment you to your parents \"ni men de liang ge er zi zhen shuai!\" (Your sons are so handsome!) after which it’s polite to laugh and brush off the compliment to show your humility \"Mei you, mei you.\" You could argue that this is also just a hollow formality. I know some relatives I saw just shy of 2 years ago who used the first line, and I sure as hell haven’t grown more than a centimeter at most. But they try their best to massage my ego, which is really conducive to me enjoying their company.",
        "To be fair, I’m also already in a great mood because when I see my relatives in Taiwan, I always know I’m in for a good time. Said relatives are descendants of Taiwan’s Lin Jia (林家), one of the first families that settled Taiwan, and owned huge swaths of the island from early on. Naturally this led to the family’s significant political and economic presence, the latter of which couldn’t be more true today. Basically what I’m saying is that they are fucking loaded. Our trip to Taizhong was an invitation from my dad’s cousins, three brothers who, in business, have shrewdly grown their family’s wealth to new heights. The second brother who I will refer to as Biao Er (second uncle) showed us around town. He made his fortune off a pharmacy chain, and now owns large parts of the city he lives in. On a central downtown street, he showed us one of his well-kempt pharmacies featuring his own brand of products. Further down, we passed by a toy store in which many years ago he had personally purchased a few toy vehicles for my brother and I. On the same building, there was a picture of an opening ceremony - sure enough, Biao Er was proudly standing behind the red ribbon.",
        "Our last stop was a high-end pastry shop owned by one of Biao Er’s childhood friends. She was genial and commanding at the same time, and we could barely glance at anything in the shop without the owner herself personally offering our family samples - not to buy, but just to try. (Mind you, a sample for 4 people is an entire pastry.) I must have eaten an entire meal’s worth of pastries by the time we left the shop, after having purchased several boxes of taiyangbing at a discounted rate that can only be described as VIP privilege. If you’re wondering why this man neglected to front the cost for us: upon our last trip to Taiwan he gifted us nearly 20 boxes of pineapple cakes and pastries - the kind you’d only dare to purchase for special occasions.",
        "So it would be the biggest of understatements to say that they take good care of us. But we try not to take advantage of them and only allow them to treat us if they truly insist on it. Despite that, his sons had us try some OG milk tea from the very first pmt establishment in the world - twice, and we later had some super classy Taiwan-style hotpot that I was unfortunately too full to appreciate properly. Honestly though, the most flattering thing about Biao Er is how generously he spends his time with us and how genuine he is. Because he doesn’t have to; our family is made up of expatriates who don’t speak Taiwanese and are only loosely relevant to Lin Jia. He’s an important guy and I wonder how much revenue an entire Friday is worth to him.",
        "I’m starting to ramble so I’m just going to say: If you are rich and big-minded, it’s really really easy to make friends. But if you can’t be either of those, being genuine gives people huge respect-boners.",
        "Pearl Milk Tea count: 3"]
    },
    {
      "id": 2,
      "title": "Taoyuan (桃园）",
      "date": "December 23, 2015",
      "images": true,
      "text": "",
      "formatted_text": ["My grandma lives in the yangsheng wenhua cun (养生文化村) nursing home, or Health and Culture Village in Taoyuan. It’s a peaceful and spacious place some twenty minutes from Taipei, that has all the functions a self-contained city would have - a bit like a small college, if college was filled with old people and the stress of study were replaced with the mortal struggle. There’s a few main roads that cut through the green hills, and divide up the different recreational, residential, and medical buildings in the village. They converge at the main lobby of the residential building, where our grandma and our family are staying for the week. The four of us share a room meant for two people, which is honestly fine except that it’s illegal - it violates their max-two-per-room guest policy. So of course there are only two towels, two pillows, two complimentary waters, and one bed. Meaning that my brother and I sleep on the floor, and that I feel criminal when calling room service for an extra towel just so I can take a shower. But hey, it’s a nice floor, and they are nice towels - and worse things have definitely happened to me. Overall, it’s truly a comfortable and relaxing place to live and I’m glad my grandma spends her days in Taiwan here.",
      "As luck would have it, we also have a really nice (for lack of a better term) room. So when my dear brother Ryan and I first stepped foot in it, we were taken aback by how neat and tidy everything was, to the point where we almost didn’t want to unpack our stuff and ruin the setting. I mean, who were we to fly thousands of miles from the other side of the world just to barge into this dwelling unannounced, which had been in a state of static perfection for perhaps months, and blasphemize its sacred silence?",
      "Perhaps this was an extreme attempt to atone for the messiness of my college dorm room. Or maybe just an ego thing, as in \"I have my shit more accounted for than any other traveller here.\" Either way, we decided that this particular room of ours would remain so organized, so put together, so pristine, that any room service worker would second-guess himself during routine maintenance, as to whether people lived there at all. Thus begins the Leave No Trace movement, or in hip lingo, LNT. Shirt on the couch? Leave no trace, put that shit away. Glasses case on the dresser? Fuck your convenience, there’s a shelf higher up where passing eyes would miss them. I swear, if I had photos each of the \"before\" and \"after\" we moved in, it would make for the most difficult \"spot the difference\" game you ever played. On one particularly offensive occasion I spotted my brother’s luggage peeking out from under the table and needed to set him straight. \"Ryan, you’re giving me the false impression that people occupy this room. That luggage literally should not exist.\" It promptly disappeared. This is the power of our conviction, our dedication to the integrity of the place we call home. We are… the leave no trace boys. #LNT",
      "Free bus count: 2"]
    },
    {
      "id": 1,
      "title": "Taipei",
      "date": "December 22, 2015",
      "images": false,
      "text": "My",
      "formatted_text": ["My first day in Taiwan has reminded me of several truths. First, finding your way around a foreign country is really difficult, and staying constantly alert in the moment is even harder. Your attention is divided among signs, stores, traffic, people… most of which aren’t immediately comprehensible and all of which that are completely novel to you. So you need to process information quickly and accurately, something that I don’t pride myself for. I want to quickly improve as a traveller, and think for myself as an adult when it comes to navigating the city. So how does one simply become competent in a foreign environment despite spotty understanding of its language and culture? After today, I feel the most important factor is accuracy, in terms of locations and the routes that lead to them.",
      "Early this morning, we arrived at our grandma’s nursing home, nestled among some fairly secluded hills. But our next destination was Taipei, Taiwan’s capital, where we would meet up with one of my very persistent aunts. The cheapest way to the heart of Taipei is through a series of buses - the first, a free shuttle bus provided from the nursing home that leaves at 9 and only 9 in the morning, which then transfers to another bus outside the ChangChung Memorial Hospital stop before heading to the Taipei’s main train terminal. I’m willing to bet that you couldn’t find your way to the train station given just these instructions, but somehow our parents thought we could. This is where the accuracy part of this traveling business comes in handy. For example, knowing beforehand the bus number and schedule of the second bus, the exact location of the stop, or forgoing these details, at least having a clear reference on Maps to guide us. To our future discomfort, we went out blind, hopping off a stop early from the first bus and navigating by eye through the streets to find the transfer stop, fumbling through several dozen bus stations before finding our ticket to Taipei.",
      "So the main takeaway from today’s travel struggles (in which the above anecdote is just the tip of the iceberg): I can’t trust my parents. On a more serious note, that means keeping myself educated instead of expecting imperfect people to have planned a perfect route. It’s not anyone’s fault but my own that I found myself lost in the maze of sweltering streets this afternoon. After all, why should I feel content not personally knowing street names and addresses, and relying on others to lead me? I could excuse my ignorance of locations as part of a language barrier, but it doesn’t excuse blind faith. If being a competent traveler means paying full attention to every sign and street name I come across instead of passing them off as indecipherable traditional Chinese characters, committing as many landmarks as possible to memory rather than just snapping a few pictures of them, and remembering the paths I’ve taken instead of just kicking back for the ride, I’m willing to work on it.",
      "Mosquito bite count: 3"]
    },
    {
      "id": 0,
      "title": "Start",
      "date": "December 22, 2015",
      "images": false,
      "text": "Hello all, welcome to my travel blog where I capture my experiences and thoughts over a month-long trip through Taiwan and China. In this first post, I lay out some guidelines and goals to keep myself motivated and focus the scope of my blog. Be as honest and authentic as possible. If this blog were my instagram, this would be the writing equivalent of #nofilter. This means I will try to avoid excessive editing and over-processing in my posts, instead revising primarily for clarity. Include a variety of subjects. There’ll be a lot of downtime, so I’ll sneak in some other thoughts and keep it spicy. Focus on just a few encounters/destinations per post, to dig deeper and avoid a \"grocery-list\" style blog. Update every other day or so, to keep me motivated to write. Thanks for your interest! There’ll be more to come soon :)",
      "formatted_text": ["Hello all, welcome to my travel blog where I capture my experiences and thoughts over a month-long trip through Taiwan and China. In this first post, I lay out some guidelines and goals to keep myself motivated and focus the scope of my blog.",
        "1: Be as honest and authentic as possible. If this blog were my instagram, this would be the writing equivalent of #nofilter.",
        "1.5: This means I will try to avoid excessive editing and over-processing in my posts, instead revising primarily for clarity",
        "2: Include a variety of subjects. There’ll be a lot of downtime, so I’ll sneak in some other thoughts and keep it spicy",
        "3: Focus on just a few encounters/destinations per post, to dig deeper and avoid a \"grocery-list\" style blog",
        "4: Update every other day or so, to keep me motivated to write.",
        "Thanks for your interest! There’ll be more to come soon :)"]
    }
  ]
}
